tap "artginzburg/tap"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
brew "argocd"
brew "azure-cli"
brew "black"
brew "freetype"
brew "gettext"
brew "cairo"
brew "cdrtools"
brew "chezmoi"
brew "node"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "cmake"
brew "codespell"
brew "deno"
brew "diff-so-fancy"
brew "docker-completion"
brew "fd"
brew "fzf"
brew "gh"
brew "harfbuzz"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "go-task"
brew "goose"
brew "govc"
brew "openjdk"
brew "gradle"
brew "helm"
brew "isort"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubecm"
brew "lazygit"
brew "markdownlint-cli2"
brew "minio-mc"
brew "tree-sitter"
brew "neovim"
brew "openjdk@21"
brew "openshift-cli"
brew "opentofu"
brew "pipx"
brew "prettier"
brew "prettierd"
brew "ripgrep"
brew "stylua"
brew "tree-sitter-cli"
brew "vips"
brew "yamlfmt"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "artginzburg/tap/sudo-touchid"
brew "hashicorp/tap/vault"
cask "1password-cli"
cask "gcloud-cli"
cask "mactex-no-gui"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
