tap "artginzburg/tap"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "siderolabs/tap"
brew "freetype"
brew "gettext"
brew "glib"
brew "cairo"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "deno"
brew "diff-so-fancy"
brew "docker-completion"
brew "fd"
brew "opus"
brew "ffmpeg"
brew "fzf"
brew "harfbuzz"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "go"
brew "go-task"
brew "goose"
brew "pkgconf"
brew "helm"
brew "k9s"
brew "kubecm"
brew "kubelogin"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "minio-mc"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "openshift-cli"
brew "opentofu"
brew "opusfile"
brew "ripgrep"
brew "tree-sitter-cli"
brew "uv"
brew "vips"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "artginzburg/tap/sudo-touchid"
brew "hashicorp/tap/vault"
brew "siderolabs/tap/talosctl"
cask "1password-cli"
cask "claude-code"
cask "gcloud-cli"
cask "mactex-no-gui"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/cweill/gotests/gotests"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
